// Напишите код, который посчитает сумму всех парных элементов в массиве. В суммировании участвуют только элементы больше 3.
// Использовать встроенные методы массивов — нельзя.

////////////////// Задание //////////////////
// const array = [1, 2, 3, 4, 5, 6];

////////////////// Решение //////////////////
const array = [1, 2, 3, 4, 5, 6];
let result = null;
for(let i = 0; i < array.length; i++){
    if(array[i] % 2 !== 0 || array[i] < 3){
        continue;
    }
    result += array[i];
}
console.log(result);